# format()方法的格式控制

#槽
# 字符串槽{}的默认顺序是0,1,2,……     format()中参数的顺序是0,1,2,……
print("{1}计算机{0}的CPU占用率为{2}%".format("2018-10-10","C",10))


'''
槽内部对格式化的配置方式
{<参数序号>:<格式控制标记>}

  :  |   <填充>  |  <对齐>  |  <宽度>  |    <,>    |   <.精度>   |  <类型>
-----|-----------|----------|----------|-----------|-------------|----------
引导 |用于填充的 | < 左对齐 | 槽设定的 | 数字的    |浮点数小数   |  整数类型
符号 |单个字符   | > 右对齐 | 输出宽度 |千位分隔符 |精度或字符串 |b,c,d,o,x,X
                   ^ 居中   |                      |最大输出长度 |  浮点数类型
                                                                 | e,E,f,%
'''

# = 指的是填充符号, ^ 居中对齐, 20 宽度
print("{0:=^20}".format("PYTHON"))
# 以 * 号填充右对齐，长度是20
print("{0:*>20}".format("BTI"))

print("{0:,.2f}".format(12345.6789))
# c 应该是chr，转换为Unicode编码对应符号 
print("{0:b},{0:c},{0:d},{0:o},{0:x},{0:X}".format(425))
print("{0:e},{0:E},{0:f},{0:%},".format(3.14))
